#+TITLE: Complex example with babel
#+OPTIONS: toc:2
#+REVEAL_MIN_SCALE: 0.1
#+REVEAL_HLEVEL: 3

** Adding a library
Let's add a library

#+name: libname
#+begin_src ascii :exports none
mylibrary
#+end_src
#+name: my_function
#+begin_src c :exports none
int my_function(int a, int b)
#+end_src

We create a header
#+begin_src c :noweb yes :results none :tangle mylibrary.h
#ifndef INCLUDE_GUARD_<<libname>>
#define INCLUDE_GUARD_<<libname>>
<<my_function>>;
#endif // INCLUDE_GUARD_<<libname>>
#+end_src

And an implementation
#+begin_src c :noweb yes :results none :tangle mylibrary.c
#include <stdio.h>
<<my_function>>{
  const int sum = a + b;
  printf("The sum of %d and %d is %d\n", a,b,sum);
  return sum;
}
#+end_src

#+begin_src cmake :tangle CMakeLists.txt :noweb yes
add_library(<<libname>> SHARED <<libname>>.c)
#+end_src

#+begin_src shell :results output
cd build
make
#+end_src

#+RESULTS:
: Consolidate compiler generated dependencies of target mylibrary
: [ 33%] Built target mylibrary
: Consolidate compiler generated dependencies of target tfm
: [ 66%] Built target tfm
: Consolidate compiler generated dependencies of target main
: [100%] Built target main

** Make
#+begin_src shell :dir build :results output :exports both
echo "PWD is $PWD"
cd build
make
#+end_src

#+RESULTS:
#+begin_example
PWD is /tmp/test/build
[ 16%] Building C object CMakeFiles/mylibrary.dir/mylibrary.c.o
[ 33%] Linking C shared library libmylibrary.dylib
[ 33%] Built target mylibrary
[ 50%] Building C object CMakeFiles/tfm.dir/testfile.c.o
[ 66%] Linking C executable tfm
[ 66%] Built target tfm
[ 83%] Building C object CMakeFiles/main.dir/main.c.o
[100%] Linking C executable main
[100%] Built target main
#+end_example

** Make test
#+begin_src shell :dir build :results output :exports both
echo "PWD is $PWD"
cd build
make test 2>&1 || true
#+end_src

#+RESULTS:
#+begin_example
PWD is /tmp/test/build
Running tests...
Test project /tmp/test/build
    Start 1: test_my_function
1/1 Test #1: test_my_function .................***Failed    0.38 sec

0% tests passed, 1 tests failed out of 1

Total Test time (real) =   0.38 sec

The following tests FAILED:
	  1 - test_my_function (Failed)
Errors while running CTest
Output from these tests are in: /tmp/test/build/Testing/Temporary/LastTest.log
Use "--rerun-failed --output-on-failure" to re-run the failed cases verbosely.
make: *** [test] Error 8
#+end_example
